package model

var MaleNames = []string{
	"Александр", "Борис", "Виктор", "Григорий", "Дмитрий", "Евгений", "Захар",
	"Илья", "Константин", "Леонид", "Михаил", "Николай", "Олег", "Павел", "Руслан",
	"Сергей", "Тимур", "Фёдор",
}

var FemaleNames = []string{
	"Анна", "Валентина", "Галина", "Дарья", "Елена", "Жанна", "Ирина",
	"Ксения", "Лариса", "Марина", "Наталья", "Ольга", "Полина", "Светлана",
	"Татьяна", "Ульяна", "Юлия",
}

var MaleSurnames = []string{
	"Иванов", "Петров", "Сидоров", "Козлов", "Морозов", "Волков", "Соколов",
	"Михайлов", "Новиков", "Фёдоров", "Зайцев", "Белов", "Егоров", "Крылов", "Орлов",
	"Серов", "Титов", "Уткин", "Фомин", "Щукин",
}

var FemaleSurnames = []string{
	"Иванова", "Петрова", "Сидорова", "Козлова", "Морозова", "Волкова", "Соколова",
	"Михайлова", "Новикова", "Фёдорова", "Зайцева", "Белова", "Егорова", "Крылова", "Орлова",
	"Серова", "Титова", "Уткина", "Фомина", "Щукина",
}
